//=============================================================================
//
// DirectX11ベース [explosion.h]
// Author : HIROHIKO HAMAYA
//
//-------------------------------------------------------
//　開発履歴：　2021/6/23 作成開始
//
//
//=============================================================================

#pragma once

//*******インクルード**********
#include "main.h"
#include "Texture.h"
#include "polygon.h"

typedef struct
{
	XMFLOAT3		Position;		// 座標
	XMFLOAT2		Size;			// サイズ
	float			Angle;			// 回転角度
	XMFLOAT2		vel;			// 速度
	bool			bUse;			// 発射フラグ
	XMFLOAT2		Scale;			// 拡大縮小
	int				nDir;			// 方向
	int				nAnimNo;		// 表示情報No.
	int				nCount;			// 残りフレーム数
}tExplosion;

class GameEffect
{
public:
	ID3D11ShaderResourceView*	g_pTexture;		//テクスチャ
	tExplosion		g_Explosion[100];		// 敵
	ANIM_PAT g_animPat[1][100] = {		//アニメーション情報...４は省略可
		{{-1, -1},{-1, -1},{-1, -1},{-1, -1},{-1, -1},{-1, -1},{-1, -1},{-1, -1},{-1, -1},{-1, -1},
		{-1, -1},{-1, -1},{-1, -1},{-1, -1},{-1, -1},{-1, -1},{-1, -1},{-1, -1},{-1, -1},{-1, -1},
		{-1, -1},{-1, -1},{-1, -1},{-1, -1},{-1, -1},{-1, -1},{-1, -1},{-1, -1},{-1, -1},{-1, -1},
		{-1, -1},{-1, -1},{-1, -1},{-1, -1},{-1, -1},{-1, -1},{-1, -1},{-1, -1},{-1, -1},{-1, -1},
		{-1, -1},{-1, -1},{-1, -1},{-1, -1},{-1, -1},{-1, -1},{-1, -1},{-1, -1},{-1, -1},{-1, -1},
		{-1, -1},{-1, -1},{-1, -1},{-1, -1},{-1, -1},{-1, -1},{-1, -1},{-1, -1},{-1, -1},{-1, -1},
		{-1, -1},{-1, -1},{-1, -1},{-1, -1},{-1, -1},{-1, -1},{-1, -1},{-1, -1},{-1, -1},{-1, -1},
		{-1, -1},{-1, -1},{-1, -1},{-1, -1},{-1, -1},{-1, -1},{-1, -1},{-1, -1},{-1, -1},{-1, -1},
		{-1, -1},{-1, -1},{-1, -1},{-1, -1},{-1, -1},{-1, -1},{-1, -1},{-1, -1},{-1, -1},{-1, -1},
		{-1, -1},{-1, -1},{-1, -1},{-1, -1},{-1, -1},{-1, -1},{-1, -1},{-1, -1},{-1, -1},{-1, -1}}		//爆発
	};
	int MAX_EXPLOSION = 100;
	XMFLOAT2 EXPLOSION_SIZE,EXPLOSION_FRAME;
	HRESULT HS_InitExplosion(char* text,XMFLOAT2 size, XMFLOAT2 frame, int no);	//初期化
	void	HS_UninitExplosion();	//終了
	void	HS_UpdateExplosion();	//更新
	void	HS_DrawExplosion();	//描画
	void	HS_SetExplosion(XMFLOAT3 pos, bool bAngle = false);	//爆発発生
};
